package ch2_객체지향.Ex20_객체지향코딩;
/*
    - 객체 지향 (클래스로 만들어놓은 코드를 이용하기 때문에 쉽게 작성하고 유지보수 할 수 있다.)
        1) 코드의 재사용성이 높다
        2) 관리가 쉽다
        3) 중복 제거

    - 핵심 개념
        1) 캡슐화 - 데이터 보호
                   데이터 캡슐화: 필드와 메서드를 하나로 묶는것
                   은닉화: 객체의 세부 내용이 외부에 들어나지 않아서 외부에서 데이터를 직접 접근하지 못하게 방지한다.
        2) 상속 - 코드를 재사용
                부모클래스의 특징과 기능들을 물려받아서 사용
                (부모클래스를 상속 받아서 수정해가면서 사용하기 때문에 중복코드를 줄일수 있다)
                (주의: 부모클래스에 변동이 생기면 자식들도 모두 영향을 받는다)
        3) 다형성
        4) 추상화
        5) 인터페이스
 */
public class Ex20_1_객체지향이란 {
}
